Repository: docJerem/ex_saml
Catalog: priv/gettext/*/LC_MESSAGES/errors.po
Languages: fr

# bad_audience
source: Make sure that the entity_id in configuration is correct
fr: Assurez-vous que l'entity_id dans la configuration est correct

# cert_no_accepted
source: Make sure the Identity Provider metadata XML file you are using in the config setting is correct and corresponds to the IdP you are attempting to talk to, you get this error if the certificate used by the IdP to sign the SAML responses has changed and you don't have the updated IdP metadata XML file
fr: Assurez-vous que le fichier XML de métadonnées du fournisseur d'identité que vous utilisez dans le paramètre de configuration est correct et correspond à l'IdP avec lequel vous essayez de parler, vous obtenez cette erreur si le certificat utilisé par l'IdP pour signer les réponses SAML a changé et que vous ne disposez pas du fichier XML de métadonnées de l'IdP mis à jour

# status_responder
source: Make sure the Identity Provider metadata XML file you are using in the config setting is correct and corresponds to the IdP you are attempting to talk to. You get this error if the certificate used by the IdP to sign the SAML responses is invalid or if the IdP is unable to verify its signature
fr: Assurez-vous que le fichier XML de métadonnées du fournisseur d'identité que vous utilisez dans le paramètre de configuration est correct et correspond à l'IdP avec lequel vous essayez de parler, vous obtenez cette erreur si le certificat utilisé par l'IdP pour signer les réponses SAML est invalide ou que l'IdP n'est pas en mesure de vérifier sa signature

# missing_assertion_signature
source: Missing signature. Please ensure that the assertions are properly signed.
fr: Signature manquante. Veuillez vous assurer que les assertions sont correctement signées.

# assertion_cert_not_accepted
source: The certificate used to sign the assertions has not been accepted. It is possible that the certificate has expired or is not supported.
fr: Le certificat utilisé pour signer les assertions n'a pas été accepté. Il est possible que le certificat ait expiré ou qu'il ne soit pas pris en charge.

# missing_envelope_signature
source: Missing envelope signature. Please make sure you uploaded correctly the Cryptr Certificate to your IdP
fr: La Signature pour les enveloppes est manquantes. Assurez-vous que vous avec correctement uploadé votre Certificat Cryptr sur votre IdP.

# invalid_nameid_policy
source: Name ID Policy is invalid. Please make sure you used the correct Key and Format for the NameID
fr: La règle spécifié pour le NameID est invalide. Assurez-vous d'utiliser la bonne clé et le bon format sur votre IdP.

# invalid_nonce
source: You are probably replaying the request twice if the challenge nonce for the anti-replay attack is invalid or missing
fr: Vous êtes probablement en train de rejouer la requête deux fois si le défi occasionnel pour l'attaque anti-rejeu est invalide ou manquant

# missing_assertion_key
source: Unauthorized authentication, invalid auth response or Relay State
fr: Authentification non autorisée, RelayState ou réponse d'authentification invalide

# bad_digest
source: Please make sure that you selected the correct Signature Algorithm (SHA-256)
fr: Assurez-vous d'avoir utilisé le bon Algorithme de Signature
